{
  "backend/main.mo": "Motoko actor defining user profiles, shops, products, carts, bargains, and messages with access control and CRUD-style APIs.",
  "feature_evidence.json": "Feature evidence report linking a deployment-related feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing routing, UI components, pages, hooks, and utilities.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light and dark themes with color tokens and global element styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router with all app routes and wraps the UI in ThemeProvider and Toaster.",
  "frontend/src/components/AppFooter.tsx": "Footer component showing copyright text and a link to caffeine.ai.",
  "frontend/src/components/AppHeader.tsx": "Responsive header with logo, navigation, share button, login button, and a mobile drawer menu.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper that composes the header, main content area, and footer.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard that shows a login prompt when unauthenticated and renders children when logged in.",
  "frontend/src/components/BargainRequestForm.tsx": "Form component allowing authenticated users to submit bargain offers with price conversion and backend mutation.",
  "frontend/src/components/BestDealRequestButton.tsx": "Button that sends a predefined 'best deal' bargain request for a product via backend mutation.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and query cache clearing.",
  "frontend/src/components/ShareLiveLinkButton.tsx": "Button that copies a generated live share URL to the clipboard and shows feedback tooltips.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and refetches queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity auth state, login flow, stored identities and related utilities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend operations for profiles, products, shops and other data mutations/queries.",
  "frontend/src/index.css": "TailwindCSS configuration defining theme variables and styles for light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React, Internet Identity provider and React Query client.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart with product details, loading/error states, subtotal calculation, and navigation to product browsing.",
  "frontend/src/pages/MessagesThreadPage.tsx": "Shows a chat thread for a product, loading messages and product info, handling message sending, and rendering real-time conversation UI.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays detailed product and shop info with actions like add-to-cart, message shopkeeper, and bargain features.",
  "frontend/src/pages/ShopDiscoveryPage.tsx": "Provides a product discovery landing page with hero content, error/loading states, and navigation to product details.",
  "frontend/src/pages/ShopkeeperProductsPage.tsx": "Allows shopkeepers to view and manage their products, including creating new listings via a dialog form.",
  "frontend/src/pages/ShopkeeperProfileFormPage.tsx": "React page that renders a shop profile creation form with validation and submits data via a mutation before navigating to the products page.",
  "frontend/src/utils/backendErrors.ts": "Provides functions to normalize backend errors into user-friendly messages and detect authentication-related errors.",
  "frontend/src/utils/currency.ts": "Utility functions to format USD-cent bigint prices as INR and convert INR values back to USD cents.",
  "frontend/src/utils/liveShareUrl.ts": "Generates a clean shareable URL by stripping query and hash parameters from the current location.",
  "frontend/src/utils/phoneLinks.ts": "Formats phone numbers for WhatsApp deep links and tel: links by cleaning non-numeric characters.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, container queries, animations, and plugin setup.",
  "project_state.json": "Describes the project state, summarizing app features, schema version, and implemented backend and frontend capabilities."
}