{
  "backend/main.mo": "Defines backend actor with authorization, storage mixins, and numerous types for products, claims, messaging, delivery, and shop profiles.",
  "feature_evidence.json": "Lists evidence linking specific files and components to the feature of publishing the current draft deployment live.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of multiple frontend files including pages, components, hooks, and utilities.",
  "frontend/DEPLOYMENT.md": "Guide describing how to publish the draft deployment to a live non-expiring deployment and how to verify functionality.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes plus global background and text styling.",
  "frontend/index.html": "Basic HTML entry point setting up root container and loading the main frontend script.",
  "frontend/src/App.tsx": "Sets up the TanStack Router with all application routes wrapped in a layout and theme/toast providers.",
  "frontend/src/components/admin/AdminGate.tsx": "Protects admin pages by checking authentication and admin status, showing loading or denial states.",
  "frontend/src/components/admin/AdminProductsTab.tsx": "Admin interface to search, sort, edit, and delete products, with dialogs and error handling.",
  "frontend/src/components/AppFooter.tsx": "Simple footer displaying branding and a link to caffeine.ai.",
  "frontend/src/components/AppHeader.tsx": "Responsive header with navigation links based on auth, shopkeeper, and admin status plus notifications and mobile menu.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper that renders header, footer, and page content within a full-height flex container.",
  "frontend/src/components/AuthGate.tsx": "Wraps protected content and prompts login when identity is missing or loading.",
  "frontend/src/components/BargainRequestForm.tsx": "Form for submitting bargain offers with price and optional note, validating input and sending a mutation.",
  "frontend/src/components/BestDealRequestButton.tsx": "Button that sends a zero‑price 'best deal' bargain request if the user is authenticated.",
  "frontend/src/components/claims/ClaimDescriptionField.tsx": "Text area input for claim descriptions with character count validation and alerts for too short or too long entries.",
  "frontend/src/components/claims/ClaimItemReview.tsx": "Lets users select a product or general claim option and shows selected item details using radio cards.",
  "frontend/src/components/claims/ClaimStatusTracker.tsx": "Displays claim progress through submitted, review, and resolution steps with status-specific messages.",
  "frontend/src/components/claims/ClaimStepper.tsx": "Renders a multi-step progress indicator for the claim submission flow with titles and descriptions.",
  "frontend/src/components/claims/ClaimTypeSelect.tsx": "Radio-based selector for choosing the type of claim, each with label, description, and icon.",
  "frontend/src/components/claims/ProofUploader.tsx": "Handles uploading up to five image or video files with validation, error messages, progress tracking, and removal.",
  "frontend/src/components/CompareAcrossShopsSection.tsx": "Displays and sorts comparable product listings across shops with navigation to each listing.",
  "frontend/src/components/DeliveryOptionsPanel.tsx": "Panel for choosing delivery or pickup, calculating simple delivery fee and handling existing orders.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button wired to Internet Identity with loading and error handling.",
  "frontend/src/components/products/DeleteProductConfirmDialog.tsx": "Confirmation dialog for deleting a product with customizable scope and disabled state during deletion.",
  "frontend/src/components/products/EditProductDialog.tsx": "Dialog for editing a product with form fields, photo uploads, condition handling, and verification labels.",
  "frontend/src/components/products/ProductPhotoGallery.tsx": "Displays a product’s photos with carousel controls and thumbnails.",
  "frontend/src/components/products/ProductPhotosPicker.tsx": "Handles image file selection, validation, previews, and upload progress for product photos.",
  "frontend/src/components/products/ProductPhotoThumb.tsx": "Shows the first product photo or a placeholder icon if none exist.",
  "frontend/src/components/reports/ReportSellerDialog.tsx": "Dialog for submitting a seller report with reason, details, and basic validation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, invalidating queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, supporting login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating product, shop, and related data through the actor API. Includes product browsing, retrieval, creation, and shop profile actions.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes with an earth‑tone palette. Applies global styles and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers. Renders the main App component and loads global styles.",
  "frontend/src/pages/AdminMonitoringPage.tsx": "Displays an admin-only dashboard with tabs for deals, reports, claims, and products. Most sections contain placeholder content except the products tab.",
  "frontend/src/pages/CartPage.tsx": "Shows the user’s shopping cart with item details, totals, loading/error states, and claim actions. Fetches cart data and product info via query hooks.",
  "frontend/src/pages/ClaimsPage.tsx": "Shows the user's list of claims, currently empty with a prompt to file a new one. Fetches claims via query hook and handles loading state.",
  "frontend/src/pages/ClaimSubmittedPage.tsx": "Displays confirmation after submitting a claim with navigation options. Uses AuthGate to require login.",
  "frontend/src/pages/ClaimWizardPage.tsx": "Placeholder claim-filing flow showing setup messages and basic navigation. Uses product and cart data but backend logic is not implemented.",
  "frontend/src/pages/DeliveryOrderDetailsPage.tsx": "Placeholder delivery order details page indicating the system is not yet implemented. Includes report dialog integration and back navigation.",
  "frontend/src/pages/MessagesThreadPage.tsx": "Displays a message thread for a product, loads messages and participant info, and allows sending new messages.",
  "frontend/src/pages/PartnerDashboardPage.tsx": "Provides delivery partner registration and availability toggling with form submission and backend mutations.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info with cart, wishlist, messaging, comparison, and delivery option actions.",
  "frontend/src/pages/ReportsPage.tsx": "Shows a simple reports dashboard indicating no submitted reports and links back to product browsing.",
  "frontend/src/pages/ShopDiscoveryPage.tsx": "Lists products with filtering, sorting, and a promotional hero section for browsing shops and deals.",
  "frontend/src/pages/ShopkeeperInboxPage.tsx": "Displays shopkeeper message threads, loading participant info and linking to each message thread page.",
  "frontend/src/pages/ShopkeeperNotificationsPage.tsx": "Displays shopkeeper notifications about likes and cart additions, with loading states and per-notification cards showing user info and timestamps.",
  "frontend/src/pages/ShopkeeperProductsPage.tsx": "Manages creation, editing, deletion, and display of a shopkeeper’s products, including dialogs, form handling, and bargain acceptance.",
  "frontend/src/pages/ShopkeeperProfileFormPage.tsx": "Provides a form for creating a shop profile with validation and submission via createShopProfile mutation.",
  "frontend/src/pages/WishlistPage.tsx": "Shows the user’s wishlist, handles product removal, and displays shop info with loading and error states.",
  "frontend/src/utils/backendErrors.ts": "Normalizes backend errors into readable messages and detects authentication-related errors.",
  "frontend/src/utils/currency.ts": "Formats bigint prices into INR currency strings.",
  "frontend/src/utils/phoneLinks.ts": "Generates WhatsApp and tel links by cleaning phone numbers.",
  "frontend/src/utils/productComparison.ts": "Provides utilities for finding matching products and sorting listings by price, rating, or distance.",
  "frontend/src/utils/productCondition.ts": "Maps product condition values to display labels and UI badge variants.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash-based), persisting them in sessionStorage, and removing them from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, and layout settings, and enabling key plugins.",
  "project_state.json": "Project metadata describing current state, features, and configuration for the app’s publishing workflow."
}