{
  "backend/main.mo": "Defines actor with access control, user profiles, shops, products, carts, bargaining, and messaging logic using persistent maps and authorization checks.",
  "feature_evidence.json": "Contains feature evidence report listing features, related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides a mapping of frontend file paths to concise summaries describing each component or page’s purpose.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with custom color system and global styles.",
  "frontend/index.html": "HTML entry file mounting the root element and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider, layout, and toast notifications.",
  "frontend/src/components/AppFooter.tsx": "Renders footer with branding, copyright, and link to caffeine.ai.",
  "frontend/src/components/AppHeader.tsx": "Header with navigation, login button, mobile menu, and conditional authenticated links.",
  "frontend/src/components/AppLayout.tsx": "Layout component providing header, footer, and page content container.",
  "frontend/src/components/AuthGate.tsx": "Authentication guard showing a login prompt when user is unauthenticated and children when authenticated.",
  "frontend/src/components/BargainRequestForm.tsx": "A dialog form allowing authenticated users to submit bargain offers with price and optional notes using a mutation.",
  "frontend/src/components/BestDealRequestButton.tsx": "Button that sends a prefilled 'best deal' bargain request if the user is authenticated.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity authentication states and clearing cached queries.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with helpers for login, logout, and identity state management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profiles, products, shops, cart items, and mutations.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining a warm earth‑tone theme with light and dark modes.",
  "frontend/src/main.tsx": "App entry point initializing React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/CartPage.tsx": "Cart page that loads cart items and product data, displays them with subtotal calculation, and handles loading or empty states.",
  "frontend/src/pages/MessagesThreadPage.tsx": "Displays a product-specific chat thread, loading messages, showing errors, and allowing authenticated users to send new messages.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product and shop info, supports adding items to cart, messaging shopkeepers, and handles loading and error states.",
  "frontend/src/pages/ShopDiscoveryPage.tsx": "Lists products with shop info for browsing, includes a hero section, error handling, and navigation to product or seller pages.",
  "frontend/src/pages/ShopkeeperProductsPage.tsx": "Allows shopkeepers to view and manage their own products, including creating new listings via a modal form.",
  "frontend/src/pages/ShopkeeperProfileFormPage.tsx": "Provides a form for creating a shop profile with validation and submits data to backend before redirecting.",
  "frontend/src/utils/backendErrors.ts": "Normalizes backend errors into user-friendly messages and detects authentication-related errors.",
  "frontend/src/utils/currency.ts": "Formats bigint price values in cents into human‑readable USD currency strings.",
  "frontend/src/utils/phoneLinks.ts": "Generates WhatsApp and telephone links by cleaning phone numbers into valid deep‑link formats.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL and hash parameters, persist them in sessionStorage, and clear stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project metadata describing the ICP dapp scaffold, existing features, and planned enhancements for backend, frontend, and UX components."
}