{
  "backend/main.mo": "Motoko canister implementing user profiles, shops, products, carts, bargaining, and messaging with access control and persistent maps.",
  "feature_evidence.json": "Feature evidence report listing currency-formatting and INR‑label UI updates with affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend components, pages, hooks, and utilities in the project.",
  "frontend/index.css": "Tailwind base styles defining theme variables for light/dark modes and applying global background and text settings.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider, layout, and toaster notifications.",
  "frontend/src/components/AppFooter.tsx": "Footer component displaying copyright text with a link and heart icon.",
  "frontend/src/components/AppHeader.tsx": "Responsive header with navigation, authentication button, logo, and mobile sheet menu.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper composing header, footer, and page content area.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate showing a login prompt when unauthenticated and loading/children states appropriately.",
  "frontend/src/components/BargainRequestForm.tsx": "A form component allowing authenticated users to submit bargain offers with desired price and optional notes, sending data via a mutation.",
  "frontend/src/components/BestDealRequestButton.tsx": "Button that sends a 'best deal' bargain request with zero price when clicked by an authenticated user.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity authentication state and triggering login or clear actions.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity login state, stored identities, and AuthClient setup.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, products, shop creation, and related mutations using the backend actor.",
  "frontend/src/index.css": "Tailwind base and utility layers defining custom color variables and styles for light and dark themes.",
  "frontend/src/main.tsx": "App entry point initializing React Query, Internet Identity provider, and rendering the main App component.",
  "frontend/src/pages/CartPage.tsx": "Displays the user's cart by fetching items and product data, showing loading, error, empty, or itemized states, and calculating subtotal.",
  "frontend/src/pages/MessagesThreadPage.tsx": "Shows a message thread for a specific product, loading messages and product details, and allows authenticated users to send new messages.",
  "frontend/src/pages/ProductDetailPage.tsx": "Fetches and displays detailed product and shop information, supporting add-to-cart actions and initiating chats with shopkeepers.",
  "frontend/src/pages/ShopDiscoveryPage.tsx": "Lists all products for browsing with a hero section and loading/error states, allowing navigation to product details or seller signup.",
  "frontend/src/pages/ShopkeeperProductsPage.tsx": "Lets authenticated shopkeepers view their products and create new listings via a modal form with validation and backend submission.",
  "frontend/src/pages/ShopkeeperProfileFormPage.tsx": "React page that renders a shopkeeper profile creation form with validation and submits data via a mutation before navigating to the products page.",
  "frontend/src/utils/backendErrors.ts": "Utilities to normalize backend errors into readable messages and detect authentication-related errors.",
  "frontend/src/utils/currency.ts": "Currency helpers to format USD-cent bigint prices as INR and convert INR amounts back to USD cents.",
  "frontend/src/utils/phoneLinks.ts": "Functions that clean phone numbers and generate WhatsApp and tel link formats.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, persisting, and clearing URL parameters using query strings and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, typography, animations, and plugin setup.",
  "project_state.json": "Metadata describing project features, versions, and included functionality for an ICP-based bargain-shopping app."
}