{
  "kind": "build_request",
  "title": "Add used-product age, product verification labels, return policy, and ensure multi-image uploads",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Extend the backend Product model to store used-product age text, product verification labels, and a return policy value, and include these fields anywhere products are returned to the frontend (e.g., product detail and browse listings).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Age Field (For Used)\n\nExample:\n\nUsed for 6 months\n\nPurchased in 2024  Product Verification Badge\n\nAdd:\n\nVerified Product\n\nQuality Checked   Return Policy Section\n\nDisplay:\n\nReturn Available\n\nNo Return\n\nExchange Only"
        ]
      },
      "acceptanceCriteria": [
        "Backend Product type includes fields for: (a) product age info for used items, (b) product verification label(s) with at least the options \"Verified Product\" and \"Quality Checked\", and (c) a return policy with exactly these user-facing options: \"Return Available\", \"No Return\", \"Exchange Only\".",
        "Product read APIs used by the frontend include these new fields (no compile-time type mismatches on generated bindings).",
        "When a product is not used, used-product age can be absent/empty without causing errors."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update backend create/update product APIs to accept and persist the new fields (used-product age text, product verification label(s), and return policy), applying basic validation so that product age is only accepted when condition is used.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Age Field (For Used)",
          "Product Verification Badge",
          "Return Policy Section"
        ]
      },
      "acceptanceCriteria": [
        "Creating a product allows providing the new fields; updating a product allows changing them.",
        "If condition is \"New\", saving a used-product age value is rejected or ignored consistently (documented by behavior in code and reflected in UI).",
        "If condition is \"Used\", used-product age can be saved as free-form text (examples like \"Used for 6 months\" and \"Purchased in 2024\" are accepted)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a conditional migration for existing product records so the new product fields have safe defaults after upgrade (do not break existing deployments/state).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Age Field (For Used)",
          "Product Verification Badge",
          "Return Policy Section"
        ]
      },
      "acceptanceCriteria": [
        "After deploying the updated canister, existing products remain readable and visible in the UI.",
        "Migrated products receive explicit default values for the new fields (e.g., no product age, no verification labels, and a default return policy), consistent across all existing records.",
        "Migration follows the project policy: only update backend/migration.mo if needed for persisted state upgrades."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the shopkeeper product creation UI to capture: (1) used-product age text shown only when condition is Used, (2) product verification label(s) allowing selection of \"Verified Product\" and/or \"Quality Checked\", and (3) return policy selection among \"Return Available\", \"No Return\", and \"Exchange Only\"; submit these values when creating a product.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Age Field (For Used)",
          "Add:\n\nVerified Product\n\nQuality Checked",
          "Return Policy Section\n\nDisplay:\n\nReturn Available\n\nNo Return\n\nExchange Only"
        ]
      },
      "acceptanceCriteria": [
        "On the Add Product dialog, when condition is set to Used, a Product age input appears; when condition is New, that input is hidden and cleared/disabled.",
        "The Add Product dialog offers verification selection including exactly \"Verified Product\" and \"Quality Checked\" (copy matches).",
        "The Add Product dialog offers a return policy selector with exactly: \"Return Available\", \"No Return\", \"Exchange Only\" (copy matches).",
        "Submitting the form creates a product with these fields persisted (verified by reloading product details and seeing the same values)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Display the new product fields on the product detail page: show a Product age section for used items, show product verification badge(s)/labels, and show a Return policy section with the selected value.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Product Age Field (For Used)",
          "Product Verification Badge",
          "Return Policy Section"
        ]
      },
      "acceptanceCriteria": [
        "If product condition is Used and product age is present, the product detail page displays it in a clearly labeled section (English label).",
        "If any product verification label is set, it is shown on the product detail page as badge(s)/label(s) with the exact text: \"Verified Product\" and/or \"Quality Checked\".",
        "The product detail page shows a Return policy section that displays exactly one of: \"Return Available\", \"No Return\", \"Exchange Only\" based on stored value.",
        "If fields are unset (e.g., older products), the page handles it gracefully without empty/awkward sections."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure multiple image upload is supported end-to-end for product creation and product detail viewing, allowing multiple photos to be uploaded, previewed, stored, and browsed in the gallery.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "🔹 7. Upload Multiple Images\n\nEspecially important for used products (to show condition clearly)."
        ]
      },
      "acceptanceCriteria": [
        "Shopkeeper can select multiple images in the product creation flow, see previews, and remove individual images before submission.",
        "Created products persist and display multiple photos in the product photo gallery (carousel + thumbnails) on the product detail page.",
        "If more than one photo exists, navigation controls and thumbnails work; if zero photos exist, the existing placeholder UI remains.",
        "No regressions to existing single-photo behavior (one image still displays correctly)."
      ]
    }
  ],
  "constraints": [
    "Use English for all user-facing text added by this change.",
    "Backend must remain a single-actor Motoko architecture with all logic in backend/main.mo; only add/modify backend/migration.mo if required for state upgrades.",
    "Do not edit files under frontend immutablePaths (compose existing UI components instead)."
  ],
  "nonGoals": [
    "Implementing third-party verification services or external audits for \"Verified Product\" / \"Quality Checked\" (these are display labels only).",
    "Adding new authentication methods beyond Internet Identity.",
    "Adding real-time chat or notifications related to product verification/returns."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}