{
  "kind": "build_request",
  "title": "Ensure the bargaining website is a working, runnable model (no new features)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make sure the existing bargaining website scaffold runs successfully end-to-end as a working model: the project must build without errors and the deployed app must load in the browser.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-16"
        ],
        "quotes": [
          "can you make my bargening website or not tell me directly"
        ]
      },
      "acceptanceCriteria": [
        "Frontend builds successfully with no TypeScript errors",
        "Backend canister builds successfully with no Motoko errors",
        "App loads in the browser and renders the main layout (header/nav + main content)"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Verify and fix (if needed) the existing core user flows already present in the project: Internet Identity login/logout, shop discovery/product listing, product detail view, add-to-cart + cart page, submit bargain request (including best-deal request), and product messages thread send/receive.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-10",
          "msg-12",
          "msg-16"
        ],
        "quotes": [
          "i need mini bargening app",
          "yes give me the working model",
          "can you make my bargening website or not tell me directly"
        ]
      },
      "acceptanceCriteria": [
        "A user can log in with Internet Identity and log out successfully",
        "Shop discovery page loads and displays products without crashing",
        "Product detail page loads for a selected product and shows product info",
        "User can add a product to the cart and the cart page reflects the item",
        "User can submit a bargain request and the action completes successfully",
        "User can open a messages thread for a product and send a message successfully"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add/ensure a clear, user-facing in-app error message (in English) for cases where backend calls fail (e.g., not authenticated, missing data, or unexpected errors) so the app does not silently fail during the core flows.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-16"
        ],
        "quotes": [
          "tell me directly"
        ]
      },
      "acceptanceCriteria": [
        "If an authenticated-only action is attempted while logged out, the UI shows a clear English message explaining that login is required",
        "If any core flow API call fails, the UI shows a toast or inline error message in English"
      ]
    }
  ],
  "constraints": [
    "Do not add new product features beyond the existing bargaining app scaffold (no new modes, AI, delivery, offline sync, or multi-shop logic).",
    "Respect the single-actor backend architecture: keep all Motoko logic in backend/main.mo and only add migration logic if state changes require it.",
    "Do not edit any frontend files under the immutable paths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new features from the project_state planned enhancements list (seeded INR data, product photo generation, smart bargain suggestion, price transparency badges, multi-shop bargain mode, delivery partners, reserve/pick-up, offline mode, AI deal assistant).",
    "Creating new brand assets or changing the existing logo/hero images."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}