{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add used-age, verification labels, return policy, and multi-image support to product create + detail UI",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Extend the shopkeeper Add Product dialog to capture used-product age (Used only), verification labels, and return policy, and submit them on create.",
      "acceptanceCriteria": [
        "On the Add Product dialog, when condition is set to Used, a Product age input appears; when condition is New, that input is hidden and cleared/disabled.",
        "The Add Product dialog offers verification selection including exactly \"Verified Product\" and \"Quality Checked\" (copy matches).",
        "The Add Product dialog offers a return policy selector with exactly: \"Return Available\", \"No Return\", \"Exchange Only\" (copy matches).",
        "Submitting the form creates a product with these fields persisted (verified by reloading product details and seeing the same values)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ShopkeeperProductsPage.tsx",
          "operation": "modify",
          "description": "Add new Add Product form fields and state: used-product age text (conditionally shown when Condition.used), multi-select verification labels (exact strings \"Verified Product\" / \"Quality Checked\"), and return policy select (exact strings \"Return Available\" / \"No Return\" / \"Exchange Only\"). Ensure the used-age input is cleared/disabled when condition switches to New. Wire these values into the create mutation payload. Use existing shadcn-ui components (e.g., Select, Input, Label, Badge/checkbox-like controls) for consistent UI; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update the create-product React Query mutation to accept and forward the additional createProduct arguments required by the generated backend typings (returnPolicy, age, productVerificationLabels) so the ShopkeeperProductsPage submission compiles and sends the new fields."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Show used age, verification label badges, and return policy on the product detail page with graceful handling of missing fields.",
      "acceptanceCriteria": [
        "If product condition is Used and product age is present, the product detail page displays it in a clearly labeled section (English label).",
        "If any product verification label is set, it is shown on the product detail page as badge(s)/label(s) with the exact text: \"Verified Product\" and/or \"Quality Checked\".",
        "The product detail page shows a Return policy section that displays exactly one of: \"Return Available\", \"No Return\", \"Exchange Only\" based on stored value.",
        "If fields are unset (e.g., older products), the page handles it gracefully without empty/awkward sections."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProductDetailPage.tsx",
          "operation": "modify",
          "description": "Render new product metadata sections using English labels: (1) a \"Product age\" section only when condition is Used and the age text is present, (2) product verification label badge(s) using the exact labelText values, and (3) a \"Return policy\" section showing the stored value. Ensure sections are omitted when values are absent to avoid awkward empty UI. Use existing shadcn-ui components (e.g., Card, Badge) for presentation; Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Ensure multi-image upload, preview/removal, persistence, and multi-image gallery browsing work without regressing single/zero-photo behavior.",
      "acceptanceCriteria": [
        "Shopkeeper can select multiple images in the product creation flow, see previews, and remove individual images before submission.",
        "Created products persist and display multiple photos in the product photo gallery (carousel + thumbnails) on the product detail page.",
        "If more than one photo exists, navigation controls and thumbnails work; if zero photos exist, the existing placeholder UI remains.",
        "No regressions to existing single-photo behavior (one image still displays correctly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/products/ProductPhotosPicker.tsx",
          "operation": "modify",
          "description": "Harden the multi-image picker UX for end-to-end flows: keep the existing multi-select input, previews, and per-image removal, and add a simple parent-driven reset mechanism (e.g., resetToken prop) so previews reliably clear after successful submission or dialog close/reopen. Continue using blob-storage's ExternalBlob to represent selected images and upload progress capability; Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ShopkeeperProductsPage.tsx",
          "operation": "modify",
          "description": "Wire the ProductPhotosPicker reset mechanism from the Add Product dialog lifecycle (successful create and/or dialog close). Ensure the create flow continues to pass an array of blob-storage ExternalBlob objects for multiple images (or null when none); Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/products/ProductPhotoGallery.tsx",
          "operation": "modify",
          "description": "Verify and adjust (if needed) the gallery behavior for 0/1/many photos: placeholder remains when no photos, single photo renders correctly, and multi-photo navigation + thumbnails remain functional using blob-storage ExternalBlob.getDirectURL for image URLs; Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}