{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Shareable live link publishing for Bargen v4",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Provide a one-click way to produce a stable, shareable live URL for the current Bargen v4 experience (distinct from any draft/preview URL variants) so others can open it in a browser.",
      "acceptanceCriteria": [
        "A new live (non-draft) version is created from the current Version 4 state without requiring additional user input.",
        "A live/shareable URL is produced for the newly published version (distinct from the draft preview link).",
        "The published live version loads successfully and matches the current draft functionality (product browsing, cart, bargaining, messaging, and INR price display)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/liveShareUrl.ts",
          "operation": "create",
          "description": "Add a small utility to compute a canonical, shareable 'live' URL from the current location by stripping any draft/preview-only query/hash parameters and preserving the current route (e.g., product detail, cart, messages) so recipients open the same view without draft flags."
        },
        {
          "path": "frontend/src/components/ShareLiveLinkButton.tsx",
          "operation": "create",
          "description": "Create a reusable UI control that generates the live/shareable URL via the liveShareUrl utility and copies it to the clipboard (with a toast confirmation) so users can share the stable public link without additional input. Use the shadcn-ui Button (and optional tooltip/popover if desired) to match existing UI patterns. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Wire the ShareLiveLinkButton into the existing header navigation (desktop and mobile menu as appropriate) so it is discoverable and available wherever the user is in the app. Ensure the generated link is presented as the 'live' share URL (not a draft/preview link)."
        }
      ]
    }
  ]
}